cf_billing/Documents/энргУстановитьПроцентРаспределенияОтрицательногоОДН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргУстановитьПроцентРаспределенияОтрицательногоОДН</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргПроцентРаспределенияОтрицательногоОДН</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПроцентРаспределения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/энргСостояниеМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСостояниеМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Documents/энргУстановитьПроцентРаспределенияОтрицательногоОДН/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
			
КонецПроцедуры

// Заполняет список команд создания на основании.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - состав команд.
// Возвращаемое значение:
//	 Булево - Ложь, функция не работает.
//
Функция ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт
	
	Возврат Ложь;	
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт 
		
	ПараметрыЗапроса  			= Новый Структура;
	Схема 						= Неопределено;
	
	ДобавитьТекстЗапросаэнргПроцентРаспределенияОтрицательногоОДН(Схема, Регистры);
		
	Если ДополнительныеСвойства.Свойство("ТаблицыПодмены") Тогда		
		ВспомогательныеПараметры 	= Новый Структура;
		энргФормированиеТекстовЗапроса.УстановитьПерехватОбращенияКТаблицам(Схема, ДополнительныеСвойства.ТаблицыПодмены, ВспомогательныеПараметры); 
	КонецЕсли;
	
	КлючиТаблицДвижений 			= энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	Запрос  						= Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("мДокументы", 					ДокументСсылка);
	Запрос.УстановитьПараметр("ПустойУникальныйИдентификатор", 	Новый УникальныйИдентификатор());
	
	Если ДополнительныеСвойства.Свойство("ТаблицыПодмены") Тогда		
		энргФормированиеТекстовЗапроса.УстановитьПараметрыТаблицыПодмены(Запрос, ВспомогательныеПараметры); 
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		Запрос.ВыполнитьПакет());
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры

Процедура ИнициализироватьТаблицыДляКонтроля(ДокументСсылка,ДополнительныеСвойства) Экспорт 
	
	Схема  										= Неопределено;
	Параметры 									= Новый Структура;
	
	ДобавитьТекстЗапросаПараметрыКонтроля(Схема);
	ДобавитьТекстЗапросаКонтрольСостояниеМКД(Схема, Параметры);
		
	КлючиТаблицКонтроля  						= Новый Структура;
			
	Для Сч = 0 По Схема.ПакетЗапросов.Количество() - 1  Цикл
		Пакет 									= Схема.ПакетЗапросов[Сч];		
		Если Не ПустаяСтрока(Пакет.ТаблицаДляПомещения) И СтрНачинаетсяС(Пакет.ТаблицаДляПомещения, "Контроль") Тогда			
			КлючиТаблицКонтроля.Вставить(Прав(Пакет.ТаблицаДляПомещения,СтрДлина(Пакет.ТаблицаДляПомещения) - СтрДлина("Контроль")),Сч);			
			Пакет.ТаблицаДляПомещения 			= "";
		КонецЕсли;		
	КонецЦикла;
	ТекстСообщенияМногоквартирныйДомЗакрыт 		= НСтр("ru = 'На дату операции мкд закрыт'"); 
	
	Запрос  									= Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("мДокументы", 								ДокументСсылка);
	Запрос.УстановитьПараметр("Строение", 									ДополнительныеСвойства.Строение);
	Запрос.УстановитьПараметр("ТекстСообщенияМногоквартирныйДомЗакрыт", 	ТекстСообщенияМногоквартирныйДомЗакрыт);
	
	ДополнительныеСвойства.Вставить("ТаблицыДляКонтроля", 					Запрос.ВыполнитьПакет());
	ДополнительныеСвойства.Вставить("КлючиТаблицКонтроля", 					КлючиТаблицКонтроля);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьТекстЗапросаэнргПроцентРаспределенияОтрицательногоОДН(Схема, Регистры)
	ИмяРегистра = "энргПроцентРаспределенияОтрицательногоОДН";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст = "ВЫБРАТЬ
	        |	ВЫБОР
	        |		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	        |			ТОГДА Шапка.ДатаФактическогоСобытия
	        |		ИНАЧЕ Шапка.Дата
	        |	КОНЕЦ КАК Период,
	        |	Шапка.Дата КАК ПериодРегистрации,
	        |	Шапка.Район КАК Район,
	        |	Шапка.МКД КАК МКД,
	        |	Шапка.Организация КАК Организация,
	        |	КоллекцияПроцентовРаспределения.Услуга КАК Услуга,
	        |	КоллекцияПроцентовРаспределения.Процент КАК Процент,
	        |	НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
	        |ИЗ
	        |	Документ.энргУстановитьПроцентРаспределенияОтрицательногоОДН КАК Шапка
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьПроцентРаспределенияОтрицательногоОДН.ПроцентРаспределения КАК КоллекцияПроцентовРаспределения
	        |		ПО Шапка.Ссылка = КоллекцияПроцентовРаспределения.Ссылка
	        |			И (Шапка.Ссылка В (&мДокументы))
	        |			И (КоллекцияПроцентовРаспределения.Ссылка В (&мДокументы))";			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
КонецПроцедуры

Процедура ДобавитьТекстЗапросаКонтрольСостояниеМКД(Схема, Параметры)
	
	ПараметрыСостоянияМКД 		= Новый Структура;
	ПараметрыВременнойТаблицы 	= Новый Массив;
	ПараметрыВременнойТаблицы.Добавить(Новый Структура("ИмяПараметра, ТаблицаИсточник, ТипПараметра, СоотвествиеПолей","ПараметрыКонтроля","ПараметрыКонтроля","ТипПараметраВременнаяТаблица", Новый Структура("Организация,Район,МКД","Организация","Район","МКД")));
	ПараметрыСостоянияМКД.Вставить("ПараметрыВТ", ПараметрыВременнойТаблицы);
	РегистрыСведений.энргСостояниеМКД.СостояниеМногоквартирногоДома(Схема,ПараметрыСостоянияМКД,"СостояниеМногоквартирногоДома");
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст 			=
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПРЕДСТАВЛЕНИЕ(ПараметрыКонтроля.Ссылка) КАК ПредставлениеОбъекта,
	|	&ТекстСообщенияМногоквартирныйДомЗакрыт КАК ТекстСообщения
	|ИЗ
	|	ПараметрыКонтроля КАК ПараметрыКонтроля
	|		ЛЕВОЕ СОЕДИНЕНИЕ СостояниеМногоквартирногоДома КАК СостояниеМногоквартирногоДома
	|		ПО ПараметрыКонтроля.Организация = СостояниеМногоквартирногоДома.Организация
	|			И ПараметрыКонтроля.Район = СостояниеМногоквартирногоДома.Район
	|			И ПараметрыКонтроля.МКД = СостояниеМногоквартирногоДома.МКД
	|ГДЕ
	|	(НЕ ЕСТЬNULL(СостояниеМногоквартирногоДома.Состояние, ЛОЖЬ)
	|			ИЛИ КОНЕЦПЕРИОДА(ПараметрыКонтроля.Период, ДЕНЬ) < ЕСТЬNULL(КОНЕЦПЕРИОДА(СостояниеМногоквартирногоДома.Период, ДЕНЬ), ДАТАВРЕМЯ(1, 1, 1)))";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения 			= "КонтрольСостояниеМКД";
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПараметрыКонтроля(Схема)
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст 		=
	"ВЫБРАТЬ
	|	энргУстановитьПроцентРаспределенияОтрицательногоОДН.Ссылка КАК Ссылка,
	|	энргУстановитьПроцентРаспределенияОтрицательногоОДН.Организация КАК Организация,
	|	энргУстановитьПроцентРаспределенияОтрицательногоОДН.Район КАК Район,
	|	энргУстановитьПроцентРаспределенияОтрицательногоОДН.МКД КАК МКД,
	|	ВЫБОР
	|		КОГДА НЕ энргУстановитьПроцентРаспределенияОтрицательногоОДН.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА энргУстановитьПроцентРаспределенияОтрицательногоОДН.ДатаФактическогоСобытия
	|		ИНАЧЕ энргУстановитьПроцентРаспределенияОтрицательногоОДН.Дата
	|	КОНЕЦ КАК Период
	|ПОМЕСТИТЬ ПараметрыКонтроля
	|ИЗ
	|	Документ.энргУстановитьПроцентРаспределенияОтрицательногоОДН КАК энргУстановитьПроцентРаспределенияОтрицательногоОДН
	|ГДЕ
	|	энргУстановитьПроцентРаспределенияОтрицательногоОДН.Ссылка В(&мДокументы)";
		
	Пакет.УстановитьТекстЗапроса(Текст);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
